In [ ]:
Name : Tavhare Siddhi Santosh
Roll No : 59
Practical No : 3

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df=pd.read_csv("Documents\Income Status.csv")

In [4]:
df

    Customer ID  Age  Annual Income  Spending Score  Gender
0         10108   23          15000              10    Male
1         10109   21          20000              15    Male
2        101010   24          25000              34    Male
3        101011   25          27500              25  Female
4        101012   23          45000              45    Male
5        101013   26          23000              38  Female
6        101014   28          43600              67  Female
7        111015   30          21567              45    Male
8        111016   23          45367              78    Male
9        111017   25          45789              34  Female
10       111018   28          23000              56  Female
11       111019   29          21000              78  Female
12       111020   31          47000              90    Male
13       111021   27          23650              34    Male

In [6]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df['Gender'] = le.fit_transform(df['Gender'])

In [7]:
newdf=df

In [8]:
df

    Customer ID  Age  Annual Income  Spending Score  Gender
0         10108   23          15000              10       1
1         10109   21          20000              15       1
2        101010   24          25000              34       1
3        101011   25          27500              25       0
4        101012   23          45000              45       1
5        101013   26          23000              38       0
6        101014   28          43600              67       0
7        111015   30          21567              45       1
8        111016   23          45367              78       1
9        111017   25          45789              34       0
10       111018   28          23000              56       0
11       111019   29          21000              78       0
12       111020   31          47000              90       1
13       111021   27          23650              34       1

In [9]:
df.mean()

Customer ID       93028.785714
Age                  25.928571
Annual Income     30462.357143
Spending Score       46.357143
Gender                0.571429
dtype: float64

In [10]:
df.loc[:,'Age'].mean()

25.928571428571427

In [11]:
df.mean(axis=1)[0:4]

0     5028.4
1     6029.2
2    25213.8
3    25712.2
dtype: float64

In [12]:
df.median()

Customer ID       106014.5
Age                   25.5
Annual Income      24325.0
Spending Score        41.5
Gender                 1.0
dtype: float64

In [13]:
df.loc[:,'Annual Income'].median()

24325.0

In [15]:
df.median(axis=1)[0:4]

0    23.0
1    21.0
2    34.0
3    25.0
dtype: float64

In [16]:
df.mode()

    Customer ID   Age  Annual Income  Spending Score  Gender
0         10108  23.0        23000.0            34.0     1.0
1         10109   NaN            NaN             NaN     NaN
2        101010   NaN            NaN             NaN     NaN
3        101011   NaN            NaN             NaN     NaN
4        101012   NaN            NaN             NaN     NaN
5        101013   NaN            NaN             NaN     NaN
6        101014   NaN            NaN             NaN     NaN
7        111015   NaN            NaN             NaN     NaN
8        111016   NaN            NaN             NaN     NaN
9        111017   NaN            NaN             NaN     NaN
10       111018   NaN            NaN             NaN     NaN
11       111019   NaN            NaN             NaN     NaN
12       111020   NaN            NaN             NaN     NaN
13       111021   NaN            NaN             NaN     NaN

In [17]:
df.loc[:,'Age'].mode()

0    23
Name: Age, dtype: int64

In [18]:
df.min()

Customer ID       10108
Age                  21
Annual Income     15000
Spending Score       10
Gender                0
dtype: int64

In [19]:
df.loc[:,'Spending Score'].min(skipna = False)

10

In [20]:
df.max()

Customer ID       111021
Age                   31
Annual Income      47000
Spending Score        90
Gender                 1
dtype: int64

In [21]:
df.loc[:,'Customer ID'].max(skipna = False)

111021

In [22]:
df.std()

Customer ID       35448.216805
Age                   2.999084
Annual Income     11858.435366
Spending Score       24.367719
Gender                0.513553
dtype: float64

In [23]:
df.loc[:,'Age'].std()

2.999084109274946

In [24]:
df.std(axis=1)[0:4]

0     7084.282977
1     8950.367099
2    43730.262064
3    43743.248699
dtype: float64

In [25]:
df.groupby(['Gender'])['Age'].mean()

Gender
0    26.833333
1    25.250000
Name: Age, dtype: float64

In [36]:
from sklearn import preprocessing
enc = preprocessing.OneHotEncoder()
enc_df = pd.DataFrame(enc.fit_transform(df[['Gender']]).toarray())

In [37]:
enc_df

      0    1
0   0.0  1.0
1   0.0  1.0
2   0.0  1.0
3   1.0  0.0
4   0.0  1.0
5   1.0  0.0
6   1.0  0.0
7   0.0  1.0
8   0.0  1.0
9   1.0  0.0
10  1.0  0.0
11  1.0  0.0
12  0.0  1.0
13  0.0  1.0

In [40]:
df

    Customer ID  Age  Annual Income  Spending Score  Gender
0         10108   23          15000              10       1
1         10109   21          20000              15       1
2        101010   24          25000              34       1
3        101011   25          27500              25       0
4        101012   23          45000              45       1
5        101013   26          23000              38       0
6        101014   28          43600              67       0
7        111015   30          21567              45       1
8        111016   23          45367              78       1
9        111017   25          45789              34       0
10       111018   28          23000              56       0
11       111019   29          21000              78       0
12       111020   31          47000              90       1
13       111021   27          23650              34       1